In [3]:
import pandas as pd
import numpy as np

In [4]:
# Lista de diccionario 
data  = {
    'nombre':['Ana','Maria','Carlos','Pedro', 'Laura'], 
    'edad': [25,32,28,45,29],
    'ciudad':['Madrid','Barcelona','Valencia','M치laga','Barcelona'],
    'salario':[4000,4500,55000,60000,70000]
}

df = pd.DataFrame(data)
print(df)

   nombre  edad     ciudad  salario
0     Ana    25     Madrid     4000
1   Maria    32  Barcelona     4500
2  Carlos    28   Valencia    55000
3   Pedro    45     M치laga    60000
4   Laura    29  Barcelona    70000

In [5]:
print("3 primeras lineas ", df.head(3))

print("2 ultimas lineas ", df.tail(2))

print(df.info())

print(df.describe())

3 primeras lineas     nombre  edad     ciudad  salario
0     Ana    25     Madrid     4000
1   Maria    32  Barcelona     4500
2  Carlos    28   Valencia    55000
2 ultimas lineas    nombre  edad     ciudad  salario
3  Pedro    45     M치laga    60000
4  Laura    29  Barcelona    70000
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   nombre   5 non-null      object
 1   edad     5 non-null      int64
 2   ciudad   5 non-null      object
 3   salario  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes
None
           edad       salario
count   5.00000      5.000000
mean   31.80000  38700.000000
std     7.79102  31909.246309
min    25.00000   4000.000000
25%    28.00000   4500.000000
50%    29.00000  55000.000000
75%    32.00000  60000.000000
max    45.00000  70000.000000

In [6]:
nombres = df['nombre']
print(nombres)
sub_df = df[['nombre','edad']]
print(sub_df)

0       Ana
1     Maria
2    Carlos
3     Pedro
4     Laura
Name: nombre, dtype: object
   nombre  edad
0     Ana    25
1   Maria    32
2  Carlos    28
3   Pedro    45
4   Laura    29

In [7]:
#Filtrado
mayores_30 = df[df['edad'] > 30]
print(mayores_30)

#Personas Madrid
madrid = df[df['ciudad'] == 'Madrid']
print(madrid)

#usando query
barcelona = df.query("ciudad == 'Barcelona'")
print(barcelona)

  nombre  edad     ciudad  salario
1  Maria    32  Barcelona     4500
3  Pedro    45     M치laga    60000
  nombre  edad  ciudad  salario
0    Ana    25  Madrid     4000
  nombre  edad     ciudad  salario
1  Maria    32  Barcelona     4500
4  Laura    29  Barcelona    70000